using System.Collections.Generic;

namespace DigitTranslater.Localization
{
    public class RuLocalizationNumbers : LanguageNumbersDescriptor
    {
        public override void InitLanguage()
        {
            Name = "RU";

            Vocabulary = new Dictionary<int, string>
            {
                { 0, "ноль" },
                { 1, "один" },
                { 2, "два" },
                { 3, "три" },
                { 4, "четыре" },
                { 5, "пять" },
                { 6, "шесть" },
                { 7, "семь" },
                { 8, "восемь" },
                { 9, "девять" },

                { 10, "десять" },
                { 11, "одиннадцать" },
                { 12, "двенадцать" },
                { 13, "тринадцать" },
                { 14, "четырнадцать" },
                { 15, "пятнадцать" },
                { 16, "шестнадцать" },
                { 17, "семнадцать" },
                { 18, "восемнадцать" },
                { 19, "девятнадцать" },

                { 20, "двадцать" },
                { 30, "тридцать" },
                { 40, "сорок" },
                { 50, "пятьдесят" },
                { 60, "шестьдесят" },
                { 70, "семьдесят" },
                { 80, "восемьдесят" },
                { 90, "девяносто" },

                { 100, "сто" },
                { 200, "двести" },
                { 300, "триста" },
                { 400, "четыреста" },
                { 500, "пятьсот" },
                { 600, "шестьсот" },
                { 700, "семьсот" },
                { 800, "восемьсот" },
                { 900, "девятьсот" },

                { -1000, "тысяч" },
                { 1000, "одна тысяча" },
                { 2000, "две тысячи" },
                { 3000, "три тысячи" },
                { 4000, "четыре тысячи" },
                { 5000, "пять тысяч" },
                { 6000, "шесть тысяч" },
                { 7000, "семь тысяч" },
                { 8000, "восемь тысяч" },
                { 9000,  "девять тысяч" },

                { 10000, "десять тысяч" },
                { 11000, "одиннадцать тысяч" },
                { 12000, "двенадцать тысяч" },
                { 13000, "тринадцать тысяч" },
                { 14000, "четырнадцать тысяч" },
                { 15000, "пятнадцать тысяч" },
                { 16000, "шестнадцать тысяч" },
                { 17000, "семнадцать тысяч" },
                { 18000, "восемнадцать тысяч" },
                { 19000,  "девятнадцать тысяч" },

                { 20000, "двадцать" },
                { 30000, "тридцать" },
                { 40000, "сорок" },
                { 50000, "пятьдесят" },
                { 60000, "шестьдесят" },
                { 70000, "семьдесят" },
                { 80000, "восемьдесят" },
                { 90000, "девяносто" },

                { 100000, "сто" },
                { 200000, "двести" },
                { 300000, "триста" },
                { 400000, "четыреста" },
                { 500000, "пятьсот" },
                { 600000, "шестьсот" },
                { 700000, "семьсот" },
                { 800000, "восемьсот" },
                { 900000, "девятьсот" },

                { -1000000, "миллионов" },
                { 1000000, "один миллион" },
                { 2000000, "два миллиона" },
                { 3000000, "три миллиона" },
                { 4000000, "четыре миллиона" },
                { 5000000, "пять миллионов" },
                { 6000000, "шесть миллионов" },
                { 7000000, "семь миллионов" },
                { 8000000, "восемь миллионов" },
                { 9000000, "девять миллионов" },

                { 10000000, "десять миллионов" },
                { 11000000, "одиннадцать миллионов" },
                { 12000000, "двенадцать миллионов" },
                { 13000000, "тринадцать миллионов" },
                { 14000000, "четырнадцать миллионов" },
                { 15000000, "пятнадцать миллионов" },
                { 16000000, "шестнадцать миллионов" },
                { 17000000, "семнадцать миллионов" },
                { 18000000, "восемнадцать миллионов" },
                { 19000000, "девятнадцать миллионов" },

                { 20000000, "двадцать" },
                { 30000000, "тридцать" },
                { 40000000, "сорок" },
                { 50000000, "пятьдесят" },
                { 60000000, "шестьдесят" },
                { 70000000, "семьдесят" },
                { 80000000, "восемьдесят" },
                { 90000000, "девяносто" },

                { 100000000, "сто" },
                { 200000000, "двести" },
                { 300000000, "триста" },
                { 400000000, "четыреста" },
                { 500000000, "пятьсот" },
                { 600000000, "шестьсот" },
                { 700000000, "семьсот" },
                { 800000000, "восемьсот" },
                { 900000000, "девятьсот" }
            };
        }
    }
}