using System.Collections.Generic;

namespace DigitTranslater.Localization
{
    public class UaLocalizationNumbers : LanguageNumbersDescriptor
    {
        public override void InitLanguage()
        {
            Name = "UA";

            Vocabulary = new Dictionary<int, string>
            {
                { 0, "нуль" },
                { 1, "один" },
                { 2, "два" },
                { 3, "три" },
                { 4, "чотири" },
                { 5, "п'ять" },
                { 6, "шість" },
                { 7, "сім" },
                { 8, "вісім" },
                { 9, "дев'ять" },

                { 10, "десять" },
                { 11, "одинадцять" },
                { 12, "дванадцять" },
                { 13, "тринадцять" },
                { 14, "чотирнадцять" },
                { 15, "п'ятнадцять" },
                { 16, "шістнадцять" },
                { 17, "сімадцять" },
                { 18, "вісімнадцять" },
                { 19, "дев'ятнадцять" },

                { 20, "двадцять" },
                { 30, "тридцять" },
                { 40, "сорок" },
                { 50, "п'ятдесят" },
                { 60, "шістдесят" },
                { 70, "сімдесят" },
                { 80, "вісімдесят" },
                { 90, "дев'яносто" },

                { 100, "сто" },
                { 200, "двісті" },
                { 300, "триста" },
                { 400, "чотириста" },
                { 500, "п'ятсот" },
                { 600, "шістьсот" },
                { 700, "сімсот" },
                { 800, "вісімсот" },
                { 900, "дев'ятсот" },

                { -1000, "тисяч" },
                { 1000, "одна тисяча" },
                { 2000, "дві тисячі" },
                { 3000, "три тисячі" },
                { 4000, "чотири тисячі" },
                { 5000, "п'ять тисяч" },
                { 6000, "шість тисяч" },
                { 7000, "сім тисяч" },
                { 8000, "вісім тисяч" },
                { 9000, "дев'ять тисяч" },

                { 10000, "десять тисяч" },
                { 11000, "одинадцять тисяч" },
                { 12000, "дванадцять тисяч" },
                { 13000, "тринадцять тисяч" },
                { 14000, "чотирнадцять тисяч" },
                { 15000, "п'ятнадцять тисяч" },
                { 16000, "шістнадцять тисяч" },
                { 17000, "сімнадцять тисяч" },
                { 18000, "вісімнадцять тисяч" },
                { 19000, "дев'ятнадцять тисяч" },

                { 20000, "двадцять" },
                { 30000, "тридцять" },
                { 40000, "сорок" },
                { 50000, "п'ятдесят" },
                { 60000, "шістдесят" },
                { 70000, "сімдесят" },
                { 80000, "вісімдесят" },
                { 90000, "дев'яносто" },

                { 100000, "сто" },
                { 200000, "двісті" },
                { 300000, "триста" },
                { 400000, "чотириста" },
                { 500000, "п'ятсот" },
                { 600000, "шістьсот" },
                { 700000, "сімсот" },
                { 800000, "вісімсот" },
                { 900000, "дев'ятсот" },

                { -1000000, "мільйонів" },
                { 1000000, "один мільйон" },
                { 2000000, "два мільйона" },
                { 3000000, "три мільйона" },
                { 4000000, "чотири мільйона" },
                { 5000000, "п'ять мільйонів" },
                { 6000000, "шість мільйонів" },
                { 7000000, "сім мільйонів" },
                { 8000000, "вісім мільйонів" },
                { 9000000, "дев'ять мільйонів" },

                { 10000000, "десять мільйонів" },
                { 11000000, "одинадцять мільйонів" },
                { 12000000, "дванадцять мільйонів" },
                { 13000000, "тринадцять мільйонів" },
                { 14000000, "чотирнадцять мільйонів" },
                { 15000000, "п'ятнадцять мільйонів" },
                { 16000000, "шістнадцять мільйонів" },
                { 17000000, "сімнадцять мільйонів" },
                { 18000000, "вісімнадцять мільйонів" },
                { 19000000, "дев'ятнадцять мільйонів" },

                { 20000000, "двадцять" },
                { 30000000, "тридцять" },
                { 40000000, "сорок" },
                { 50000000, "п'ятдесят" },
                { 60000000, "шістдесят" },
                { 70000000, "сімдесят" },
                { 80000000, "вісімдесят" },
                { 90000000, "дев'яносто" },

                { 100000000, "сто" },
                { 200000000, "двісті" },
                { 300000000, "триста" },
                { 400000000, "чотириста" },
                { 500000000, "п'ятсот" },
                { 600000000, "шістьсот" },
                { 700000000, "сімсот" },
                { 800000000, "вісімсот" },
                { 900000000, "дев'ятсот" }
            };
        }
    }
}